; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v11 ?v9)
             (pred_9 ?v7 ?v3)
             (pred_7 ?v11 ?v3)
             (pred_12 ?v5 ?v11 )
	     (pred_1 ?v11)
             (pred_11 ?v6)
             (pred_8 ?v7)
             (pred_3 ?v3)
             (pred_6 ?v11)
             (pred_4 ?v7)
             (pred_2 ?v11)
             (pred_5 ))



(:action op_5
:parameters (?v13 ?v12 ?v8 ?v1)
:precondition (and (pred_11 ?v13) (pred_11 ?v12) (pred_8 ?v8) (pred_3 ?v1)
          (pred_10 ?v13 ?v12) (pred_9 ?v8 ?v1)
                   (pred_7 ?v12 ?v1) (pred_1 ?v13) 
                   (pred_6 ?v12) (pred_4 ?v8))
:effect (and  (pred_2 ?v12) (not (pred_6 ?v12))))


(:action op_1
:parameters (?v13 ?v4)
:precondition (and (pred_11 ?v13) (pred_11 ?v4)
               (pred_1 ?v13) (pred_10 ?v13 ?v4) (pred_2 ?v4))
:effect (and (pred_1 ?v4) (not (pred_1 ?v13))))

(:action op_2
:parameters (?v13 ?v8)
:precondition (and (pred_11 ?v13) (pred_8 ?v8) 
                  (pred_1 ?v13) (pred_12 ?v8 ?v13) (pred_5 ))
:effect (and (pred_4 ?v8)
   (not (pred_12 ?v8 ?v13)) (not (pred_5 ))))


(:action op_4
:parameters (?v13 ?v10 ?v2)
:precondition (and (pred_11 ?v13) (pred_8 ?v10) (pred_8 ?v2)
                  (pred_1 ?v13) (pred_4 ?v2) (pred_12 ?v10 ?v13))
:effect (and (pred_4 ?v10) (pred_12 ?v2 ?v13)
        (not (pred_4 ?v2)) (not (pred_12 ?v10 ?v13))))

(:action op_3
:parameters (?v13 ?v8)
:precondition (and (pred_11 ?v13) (pred_8 ?v8) 
                  (pred_1 ?v13) (pred_4 ?v8))
:effect (and (pred_5 ) (pred_12 ?v8 ?v13) (not (pred_4 ?v8)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_24 obj_30 obj_07 obj_26 obj_11 obj_06 obj_25 obj_27 obj_32 obj_19 obj_12 obj_22 obj_13 obj_29 obj_05 obj_23 obj_08 obj_21 obj_18 obj_31 obj_04 obj_09 obj_16 obj_20 obj_02
    obj_14 obj_10 obj_17
    obj_15 obj_28 obj_01 obj_03
    )

    (:init
       (pred_5)

       (pred_11 obj_24)
       (pred_11 obj_30)
       (pred_11 obj_07)
       (pred_11 obj_26)
       (pred_11 obj_11)
       (pred_11 obj_06)
       (pred_11 obj_25)
       (pred_11 obj_27)
       (pred_11 obj_32)
       (pred_11 obj_19)
       (pred_11 obj_12)
       (pred_11 obj_22)
       (pred_11 obj_13)
       (pred_11 obj_29)
       (pred_11 obj_05)
       (pred_11 obj_23)
       (pred_11 obj_08)
       (pred_11 obj_21)
       (pred_11 obj_18)
       (pred_11 obj_31)
       (pred_11 obj_04)
       (pred_11 obj_09)
       (pred_11 obj_16)
       (pred_11 obj_20)
       (pred_11 obj_02)
       (pred_3 obj_14)
       (pred_3 obj_10)
       (pred_3 obj_17)
       (pred_8 obj_15)
       (pred_8 obj_28)
       (pred_8 obj_01)
       (pred_8 obj_03)

       (pred_10 obj_24 obj_06)
       (pred_10 obj_24 obj_30)
       (pred_10 obj_30 obj_25)
       (pred_10 obj_30 obj_07)
       (pred_10 obj_30 obj_24)
       (pred_10 obj_07 obj_27)
       (pred_10 obj_07 obj_26)
       (pred_10 obj_07 obj_30)
       (pred_10 obj_26 obj_32)
       (pred_10 obj_26 obj_11)
       (pred_10 obj_26 obj_07)
       (pred_10 obj_11 obj_19)
       (pred_10 obj_11 obj_26)
       (pred_10 obj_06 obj_12)
       (pred_10 obj_06 obj_25)
       (pred_10 obj_06 obj_24)
       (pred_10 obj_25 obj_22)
       (pred_10 obj_25 obj_27)
       (pred_10 obj_25 obj_30)
       (pred_10 obj_25 obj_06)
       (pred_10 obj_27 obj_13)
       (pred_10 obj_27 obj_32)
       (pred_10 obj_27 obj_07)
       (pred_10 obj_27 obj_25)
       (pred_10 obj_32 obj_29)
       (pred_10 obj_32 obj_19)
       (pred_10 obj_32 obj_26)
       (pred_10 obj_32 obj_27)
       (pred_10 obj_19 obj_05)
       (pred_10 obj_19 obj_11)
       (pred_10 obj_19 obj_32)
       (pred_10 obj_12 obj_23)
       (pred_10 obj_12 obj_22)
       (pred_10 obj_12 obj_06)
       (pred_10 obj_22 obj_08)
       (pred_10 obj_22 obj_13)
       (pred_10 obj_22 obj_25)
       (pred_10 obj_22 obj_12)
       (pred_10 obj_13 obj_21)
       (pred_10 obj_13 obj_29)
       (pred_10 obj_13 obj_27)
       (pred_10 obj_13 obj_22)
       (pred_10 obj_29 obj_18)
       (pred_10 obj_29 obj_05)
       (pred_10 obj_29 obj_32)
       (pred_10 obj_29 obj_13)
       (pred_10 obj_05 obj_31)
       (pred_10 obj_05 obj_19)
       (pred_10 obj_05 obj_29)
       (pred_10 obj_23 obj_04)
       (pred_10 obj_23 obj_08)
       (pred_10 obj_23 obj_12)
       (pred_10 obj_08 obj_09)
       (pred_10 obj_08 obj_21)
       (pred_10 obj_08 obj_22)
       (pred_10 obj_08 obj_23)
       (pred_10 obj_21 obj_16)
       (pred_10 obj_21 obj_18)
       (pred_10 obj_21 obj_13)
       (pred_10 obj_21 obj_08)
       (pred_10 obj_18 obj_20)
       (pred_10 obj_18 obj_31)
       (pred_10 obj_18 obj_29)
       (pred_10 obj_18 obj_21)
       (pred_10 obj_31 obj_02)
       (pred_10 obj_31 obj_05)
       (pred_10 obj_31 obj_18)
       (pred_10 obj_04 obj_09)
       (pred_10 obj_04 obj_23)
       (pred_10 obj_09 obj_16)
       (pred_10 obj_09 obj_08)
       (pred_10 obj_09 obj_04)
       (pred_10 obj_16 obj_20)
       (pred_10 obj_16 obj_21)
       (pred_10 obj_16 obj_09)
       (pred_10 obj_20 obj_02)
       (pred_10 obj_20 obj_18)
       (pred_10 obj_20 obj_16)
       (pred_10 obj_02 obj_31)
       (pred_10 obj_02 obj_20)
       (pred_6 obj_19)
       (pred_6 obj_31)
       (pred_6 obj_09)
       (pred_6 obj_20)
       (pred_7  obj_19 obj_14)
       (pred_7  obj_31 obj_10)
       (pred_7  obj_09 obj_17)
       (pred_7  obj_20 obj_10)
       (pred_2 obj_24)
       (pred_2 obj_30)
       (pred_2 obj_07)
       (pred_2 obj_26)
       (pred_2 obj_11)
       (pred_2 obj_06)
       (pred_2 obj_25)
       (pred_2 obj_27)
       (pred_2 obj_32)
       (pred_2 obj_12)
       (pred_2 obj_22)
       (pred_2 obj_13)
       (pred_2 obj_29)
       (pred_2 obj_05)
       (pred_2 obj_23)
       (pred_2 obj_08)
       (pred_2 obj_21)
       (pred_2 obj_18)
       (pred_2 obj_04)
       (pred_2 obj_16)
       (pred_2 obj_02)

       (pred_9  obj_15 obj_14)
       (pred_9  obj_28 obj_10)
       (pred_9  obj_01 obj_17)
       (pred_9  obj_03 obj_14)
       (pred_12 obj_15 obj_30)
       (pred_12 obj_28 obj_06)
       (pred_12 obj_01 obj_12)
       (pred_12 obj_03 obj_27)
       (pred_1 obj_24)
    )

    (:goal (and
       (pred_12 obj_15 obj_26)
       (pred_12 obj_01 obj_30)
       (pred_12 obj_03 obj_32)
    ))
(:constraints
  (always (not (pred_1 obj_07)))
)
)

; plan
1. (op_1 obj_24 obj_30)
   deleted: (pred_1 obj_24)
   added: (pred_1 obj_30)
   goals met: 0 of 3
2. (op_1 obj_30 obj_25)
   deleted: (pred_1 obj_30)
   added: (pred_1 obj_25)
   goals met: 0 of 3
3. (op_1 obj_25 obj_27)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_27)
   goals met: 0 of 3
4. (op_2 obj_27 obj_03)
   deleted: (pred_12 obj_03 obj_27) (pred_5)
   added: (pred_4 obj_03)
   goals met: 0 of 3
5. (op_1 obj_27 obj_32)
   deleted: (pred_1 obj_27)
   added: (pred_1 obj_32)
   goals met: 0 of 3
6. (op_3 obj_32 obj_03)
   deleted: (pred_4 obj_03)
   added: (pred_5) (pred_12 obj_03 obj_32)
   goals met: 1 of 3
7. (op_1 obj_32 obj_27)
   deleted: (pred_1 obj_32)
   added: (pred_1 obj_27)
   goals met: 1 of 3
8. (op_1 obj_27 obj_25)
   deleted: (pred_1 obj_27)
   added: (pred_1 obj_25)
   goals met: 1 of 3
9. (op_1 obj_25 obj_06)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_06)
   goals met: 1 of 3
10. (op_1 obj_06 obj_12)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_12)
   goals met: 1 of 3
11. (op_2 obj_12 obj_01)
   deleted: (pred_12 obj_01 obj_12) (pred_5)
   added: (pred_4 obj_01)
   goals met: 1 of 3
12. (op_1 obj_12 obj_06)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_06)
   goals met: 1 of 3
13. (op_1 obj_06 obj_24)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_24)
   goals met: 1 of 3
14. (op_1 obj_24 obj_30)
   deleted: (pred_1 obj_24)
   added: (pred_1 obj_30)
   goals met: 1 of 3
15. (op_4 obj_30 obj_15 obj_01)
   deleted: (pred_4 obj_01) (pred_12 obj_15 obj_30)
   added: (pred_4 obj_15) (pred_12 obj_01 obj_30)
   goals met: 2 of 3
16. (op_1 obj_30 obj_25)
   deleted: (pred_1 obj_30)
   added: (pred_1 obj_25)
   goals met: 2 of 3
17. (op_1 obj_25 obj_27)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_27)
   goals met: 2 of 3
18. (op_1 obj_27 obj_32)
   deleted: (pred_1 obj_27)
   added: (pred_1 obj_32)
   goals met: 2 of 3
19. (op_1 obj_32 obj_26)
   deleted: (pred_1 obj_32)
   added: (pred_1 obj_26)
   goals met: 2 of 3
20. (op_3 obj_26 obj_15)
   deleted: (pred_4 obj_15)
   added: (pred_5) (pred_12 obj_15 obj_26)
   goals met: 3 of 3
